using System;

namespace Lesson_003
{
    class Program
    {
        static void Main(string[] args)
        {
            //1. Написать программу, выводящую элементы двумерного массива по диагонали.

            //2. Написать программу «Телефонный справочник»: создать двумерный массив 5х2, хранящий список телефонных контактов: первый элемент хранит имя контакта, второй — номер телефона/email.

            //3.Написать программу, выводящую введённую пользователем строку в обратном порядке(olleH вместо Hello).

            //*«Морской бой»: вывести на экран массив 10х10, состоящий из символов X и O, где Х — элементы кораблей, а О — свободные клетки.

            /*4.доп.ДЗ Написать программу, которой на вход подается одномерный массив и число n(может быть положительным, или отрицательным), 
                при этом программа должена сместить все элементы массива на n позиций.Для усложнения задачи нельзя пользоваться вспомогательными массивами.
            */

        }
    }
}
